In [3]:
def factorial(n):
    result = 1
    for i in range(1, n+1):
        result *=i
    return result

In [4]:
factorial(3)

6

In [9]:
def store_records(name,age,sec,roll_no,Class):
    data = {'Name':name,'Age':age,'Sec':sec,'Roll no':roll_no,'class':Class}
    import pandas as pd
    result = pd.DataFrame(data, index = [1])
    return result

In [11]:
display(store_records('Daksh',19,'G','12','12'))
display(store_records('Naman',19,'G','12','12'))
display(store_records('Raman',19,'G','12','12'))

    Name  Age Sec Roll no class
1  Daksh   19   G      12    12

    Name  Age Sec Roll no class
1  Naman   19   G      12    12

    Name  Age Sec Roll no class
1  Raman   19   G      12    12

In [20]:
def student_records(**kwargs):
    #print(kwargs)
    #try exception
    import pandas as pd
    try:
        result = pd.DataFrame(kwargs)
        return result

    except:
        result = pd.DataFrame(kwargs, index=[1])
        return result

In [21]:
student_records(Name = ['Daksh','Mohan','Sohan'],Age = 19, sec = 'E2', Roll_No = 112, Address = "Manakpura")

    Name  Age sec  Roll_No    Address
1  Daksh   19  E2      112  Manakpura